; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

module asm ".section .gnu.warning.siggetmask"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.__fpending"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.gets"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.tmpnam"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.mktemp"
module asm "\09.previous"

%struct.__uclibc_locale_struct.194 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.193 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!4 = !{}
!5 = !{!6, !7, !9, !11, !23, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !13, line: 1036, baseType: !14)
!13 = !DIFile(filename: "./include/elf.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1026, size: 128, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !14, file: !13, line: 1028, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 58, baseType: !10)
!18 = !DIFile(filename: "./include/stdint.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !14, file: !13, line: 1035, baseType: !20, size: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !13, line: 1029, size: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !20, file: !13, line: 1031, baseType: !17, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 46, baseType: !10)
!24 = !DIFile(filename: "/usr/lib/llvm-11/lib/clang/11.1.0/include/stddef.h", directory: "")
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!0, !27, !31, !33, !35, !38, !40, !46, !49}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !29, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !29, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !42, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !43, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "__evoke_link_warning_siggetmask", scope: !53, file: !54, line: 31, type: !56, isLocal: true, isDefinition: true)
!53 = distinct !DICompileUnit(language: DW_LANG_C99, file: !54, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !55, splitDebugInlining: false, nameTableKind: None)
!54 = !DIFile(filename: "libc/signal/siggetmask.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!55 = !{!51}
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 456, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 57)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "__evoke_link_warning___fpending", scope: !61, file: !62, line: 24, type: !64, isLocal: true, isDefinition: true)
!61 = distinct !DICompileUnit(language: DW_LANG_C99, file: !62, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !63, splitDebugInlining: false, nameTableKind: None)
!62 = !DIFile(filename: "libc/stdio/__fpending.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!63 = !{!59}
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 1336, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 167)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "__evoke_link_warning_gets", scope: !69, file: !70, line: 10, type: !56, isLocal: true, isDefinition: true)
!69 = distinct !DICompileUnit(language: DW_LANG_C99, file: !70, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !71, splitDebugInlining: false, nameTableKind: None)
!70 = !DIFile(filename: "libc/stdio/gets.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!71 = !{!67}
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "__evoke_link_warning_tmpnam", scope: !74, file: !75, line: 54, type: !83, isLocal: true, isDefinition: true)
!74 = distinct !DICompileUnit(language: DW_LANG_C99, file: !75, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !76, globals: !77, splitDebugInlining: false, nameTableKind: None)
!75 = !DIFile(filename: "libc/stdio/tmpnam.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!76 = !{!6, !7}
!77 = !{!72, !78}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "tmpnam_buffer", scope: !74, file: !75, line: 25, type: !80, isLocal: true, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 20)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 440, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 55)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "__evoke_link_warning_mktemp", scope: !88, file: !89, line: 35, type: !83, isLocal: true, isDefinition: true)
!88 = distinct !DICompileUnit(language: DW_LANG_C99, file: !89, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !90, splitDebugInlining: false, nameTableKind: None)
!89 = !DIFile(filename: "libc/stdlib/mktemp.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!90 = !{!86}
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "n_calls", scope: !93, file: !94, line: 1347, type: !45, isLocal: true, isDefinition: true)
!93 = distinct !DISubprogram(name: "getcwd", scope: !94, file: !94, line: 1346, type: !95, scopeLine: 1346, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!94 = !DIFile(filename: "runtime/POSIX/fd.c", directory: "/home/framos/Tools/Klee/klee")
!95 = !DISubroutineType(types: !96)
!96 = !{!7, !7, !23}
!97 = distinct !DICompileUnit(language: DW_LANG_C89, file: !98, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !99, retainedTypes: !120, globals: !179, splitDebugInlining: false, nameTableKind: None)
!98 = !DIFile(filename: "/home/framos/Tools/Klee/klee/runtime/POSIX/fd.c", directory: "/home/framos/Tools/Klee/klee/build/runtime/POSIX")
!99 = !{!100, !108}
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !101, line: 51, baseType: !102, size: 32, elements: !103)
!101 = !DIFile(filename: "runtime/POSIX/fd.h", directory: "/home/framos/Tools/Klee/klee")
!102 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!103 = !{!104, !105, !106, !107}
!104 = !DIEnumerator(name: "eOpen", value: 1, isUnsigned: true)
!105 = !DIEnumerator(name: "eCloseOnExec", value: 2, isUnsigned: true)
!106 = !DIEnumerator(name: "eReadable", value: 4, isUnsigned: true)
!107 = !DIEnumerator(name: "eWriteable", value: 8, isUnsigned: true)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !109, line: 97, baseType: !102, size: 32, elements: !110)
!109 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118, !119}
!111 = !DIEnumerator(name: "DT_UNKNOWN", value: 0, isUnsigned: true)
!112 = !DIEnumerator(name: "DT_FIFO", value: 1, isUnsigned: true)
!113 = !DIEnumerator(name: "DT_CHR", value: 2, isUnsigned: true)
!114 = !DIEnumerator(name: "DT_DIR", value: 4, isUnsigned: true)
!115 = !DIEnumerator(name: "DT_BLK", value: 6, isUnsigned: true)
!116 = !DIEnumerator(name: "DT_REG", value: 8, isUnsigned: true)
!117 = !DIEnumerator(name: "DT_LNK", value: 10, isUnsigned: true)
!118 = !DIEnumerator(name: "DT_SOCK", value: 12, isUnsigned: true)
!119 = !DIEnumerator(name: "DT_WHT", value: 14, isUnsigned: true)
!120 = !{!121, !6, !122, !10, !126, !7, !141, !45, !8}
!121 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !123, line: 93, baseType: !124)
!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !125, line: 141, baseType: !121)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !128, line: 37, size: 2240, elements: !129)
!128 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!129 = !{!130, !132, !133, !135, !137}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !127, file: !128, line: 39, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !125, line: 137, baseType: !10)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !127, file: !128, line: 40, baseType: !124, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !127, file: !128, line: 41, baseType: !134, size: 16, offset: 128)
!134 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !127, file: !128, line: 42, baseType: !136, size: 8, offset: 144)
!136 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !127, file: !128, line: 43, baseType: !138, size: 2048, offset: 152)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 256)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !143, line: 46, size: 1152, elements: !144)
!143 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!144 = !{!145, !147, !149, !151, !153, !155, !157, !158, !159, !161, !163, !165, !173, !174, !175}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !142, file: !143, line: 48, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !125, line: 133, baseType: !10)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !142, file: !143, line: 53, baseType: !148, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !125, line: 136, baseType: !10)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !142, file: !143, line: 61, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !125, line: 139, baseType: !10)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !142, file: !143, line: 62, baseType: !152, size: 32, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !125, line: 138, baseType: !102)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !142, file: !143, line: 64, baseType: !154, size: 32, offset: 224)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !125, line: 134, baseType: !102)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !142, file: !143, line: 65, baseType: !156, size: 32, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !125, line: 135, baseType: !102)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !142, file: !143, line: 67, baseType: !45, size: 32, offset: 288)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !142, file: !143, line: 69, baseType: !146, size: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !142, file: !143, line: 74, baseType: !160, size: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !125, line: 140, baseType: !121)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !142, file: !143, line: 78, baseType: !162, size: 64, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !125, line: 162, baseType: !121)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !142, file: !143, line: 80, baseType: !164, size: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !125, line: 167, baseType: !121)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !142, file: !143, line: 91, baseType: !166, size: 128, offset: 576)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !167, line: 9, size: 128, elements: !168)
!167 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!168 = !{!169, !171}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !166, file: !167, line: 11, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !125, line: 148, baseType: !121)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !166, file: !167, line: 12, baseType: !172, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !125, line: 184, baseType: !121)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !142, file: !143, line: 92, baseType: !166, size: 128, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !142, file: !143, line: 93, baseType: !166, size: 128, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !142, file: !143, line: 106, baseType: !176, size: 192, offset: 960)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 192, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 3)
!179 = !{!180, !185, !192, !199, !205, !210, !91}
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "n_calls", scope: !182, file: !94, line: 313, type: !45, isLocal: true, isDefinition: true)
!182 = distinct !DISubprogram(name: "close", scope: !94, file: !94, line: 312, type: !183, scopeLine: 312, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!183 = !DISubroutineType(types: !184)
!184 = !{!45, !45}
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "n_calls", scope: !187, file: !94, line: 345, type: !45, isLocal: true, isDefinition: true)
!187 = distinct !DISubprogram(name: "read", scope: !94, file: !94, line: 344, type: !188, scopeLine: 344, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!188 = !DISubroutineType(types: !189)
!189 = !{!190, !45, !6, !23}
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !123, line: 109, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !125, line: 181, baseType: !121)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "n_calls", scope: !194, file: !94, line: 411, type: !45, isLocal: true, isDefinition: true)
!194 = distinct !DISubprogram(name: "write", scope: !94, file: !94, line: 410, type: !195, scopeLine: 410, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!195 = !DISubroutineType(types: !196)
!196 = !{!190, !45, !197, !23}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "n_calls", scope: !201, file: !94, line: 647, type: !45, isLocal: true, isDefinition: true)
!201 = distinct !DISubprogram(name: "chmod", scope: !94, file: !94, line: 646, type: !202, scopeLine: 646, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!202 = !DISubroutineType(types: !203)
!203 = !{!45, !29, !204}
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !123, line: 70, baseType: !152)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "n_calls", scope: !207, file: !94, line: 666, type: !45, isLocal: true, isDefinition: true)
!207 = distinct !DISubprogram(name: "fchmod", scope: !94, file: !94, line: 665, type: !208, scopeLine: 665, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!208 = !DISubroutineType(types: !209)
!209 = !{!45, !45, !204}
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "n_calls", scope: !212, file: !94, line: 752, type: !45, isLocal: true, isDefinition: true)
!212 = distinct !DISubprogram(name: "__fd_ftruncate", scope: !94, file: !94, line: 751, type: !213, scopeLine: 751, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!213 = !DISubroutineType(types: !214)
!214 = !{!45, !45, !122}
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "letters", scope: !217, file: !218, line: 135, type: !227, isLocal: true, isDefinition: true)
!217 = distinct !DICompileUnit(language: DW_LANG_C99, file: !218, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !219, globals: !220, splitDebugInlining: false, nameTableKind: None)
!218 = !DIFile(filename: "libc/misc/internals/tempname.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!219 = !{!6, !17}
!220 = !{!221, !215}
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "value", scope: !223, file: !218, line: 159, type: !17, isLocal: true, isDefinition: true)
!223 = distinct !DISubprogram(name: "brain_damaged_fillrand", scope: !218, file: !218, line: 154, type: !224, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !4)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !226, !102}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 504, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 63)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !232, file: !266, line: 375, type: !505, isLocal: false, isDefinition: true)
!232 = distinct !DICompileUnit(language: DW_LANG_C99, file: !233, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !234, retainedTypes: !256, globals: !308, splitDebugInlining: false, nameTableKind: None)
!233 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!234 = !{!235, !241}
!235 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !236, line: 90, baseType: !102, size: 32, elements: !237)
!236 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!237 = !{!238, !239, !240}
!238 = !DIEnumerator(name: "__ctype_encoding_7_bit", value: 0, isUnsigned: true)
!239 = !DIEnumerator(name: "__ctype_encoding_utf8", value: 1, isUnsigned: true)
!240 = !DIEnumerator(name: "__ctype_encoding_8_bit", value: 2, isUnsigned: true)
!241 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !242, line: 48, baseType: !102, size: 32, elements: !243)
!242 = !DIFile(filename: "./include/ctype.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!243 = !{!244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!244 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!245 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!246 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!247 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!248 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!249 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!250 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!251 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!252 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!253 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!254 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!255 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!256 = !{!45, !257, !7, !258, !260, !263, !136, !226, !264, !277, !285, !10}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 52, baseType: !134)
!263 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !266, line: 400, baseType: !267)
!266 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !266, line: 390, size: 128, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !267, file: !266, line: 391, baseType: !262, size: 16)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !267, file: !266, line: 392, baseType: !262, size: 16, offset: 16)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !267, file: !266, line: 393, baseType: !262, size: 16, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !267, file: !266, line: 394, baseType: !262, size: 16, offset: 48)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !267, file: !266, line: 396, baseType: !262, size: 16, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !267, file: !266, line: 397, baseType: !262, size: 16, offset: 80)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !267, file: !266, line: 398, baseType: !262, size: 16, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !267, file: !266, line: 399, baseType: !262, size: 16, offset: 112)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !266, line: 430, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !266, line: 425, size: 64, elements: !280)
!280 = !{!281, !282, !283, !284}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !279, file: !266, line: 426, baseType: !262, size: 16)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !279, file: !266, line: 427, baseType: !262, size: 16, offset: 16)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !279, file: !266, line: 428, baseType: !262, size: 16, offset: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !279, file: !266, line: 429, baseType: !262, size: 16, offset: 48)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !266, line: 423, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !266, line: 402, size: 304, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !287, file: !266, line: 403, baseType: !262, size: 16)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !287, file: !266, line: 404, baseType: !262, size: 16, offset: 16)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !287, file: !266, line: 405, baseType: !262, size: 16, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !287, file: !266, line: 406, baseType: !262, size: 16, offset: 48)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !287, file: !266, line: 407, baseType: !262, size: 16, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !287, file: !266, line: 408, baseType: !262, size: 16, offset: 80)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !287, file: !266, line: 409, baseType: !262, size: 16, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !287, file: !266, line: 410, baseType: !262, size: 16, offset: 112)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !287, file: !266, line: 411, baseType: !262, size: 16, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !287, file: !266, line: 412, baseType: !262, size: 16, offset: 144)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !287, file: !266, line: 413, baseType: !262, size: 16, offset: 160)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !287, file: !266, line: 414, baseType: !262, size: 16, offset: 176)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !287, file: !266, line: 415, baseType: !262, size: 16, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !287, file: !266, line: 416, baseType: !262, size: 16, offset: 208)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !287, file: !266, line: 418, baseType: !262, size: 16, offset: 224)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !287, file: !266, line: 419, baseType: !262, size: 16, offset: 240)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !287, file: !266, line: 420, baseType: !262, size: 16, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !287, file: !266, line: 421, baseType: !262, size: 16, offset: 272)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !287, file: !266, line: 422, baseType: !262, size: 16, offset: 288)
!308 = !{!309, !493, !230, !495, !498, !500}
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "__global_locale", scope: !232, file: !266, line: 377, type: !311, isLocal: false, isDefinition: true)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !236, line: 330, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !236, line: 154, size: 26560, elements: !314)
!314 = !{!315, !322, !328, !329, !333, !335, !336, !340, !344, !346, !347, !348, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !367, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !313, file: !236, line: 156, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !319, line: 38, baseType: !320)
!319 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !321, line: 44, baseType: !134)
!321 = !DIFile(filename: "./include/bits/types.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !313, file: !236, line: 157, baseType: !323, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !319, line: 42, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !321, line: 43, baseType: !327)
!327 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !313, file: !236, line: 158, baseType: !323, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !313, file: !236, line: 162, baseType: !330, size: 6144, offset: 192)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 6144, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !313, file: !236, line: 163, baseType: !334, size: 6144, offset: 6336)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 6144, elements: !331)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !313, file: !236, line: 164, baseType: !334, size: 6144, offset: 12480)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !313, file: !236, line: 168, baseType: !337, size: 112, offset: 18624)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 112, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 14)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !313, file: !236, line: 174, baseType: !341, size: 96, offset: 18736)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 96, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 6)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !313, file: !236, line: 175, baseType: !345, size: 48, offset: 18832)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 48, elements: !342)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !313, file: !236, line: 178, baseType: !136, size: 8, offset: 18880)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !313, file: !236, line: 179, baseType: !136, size: 8, offset: 18888)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !313, file: !236, line: 180, baseType: !349, size: 80, offset: 18896)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 80, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 10)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !313, file: !236, line: 183, baseType: !258, size: 64, offset: 19008)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !313, file: !236, line: 184, baseType: !258, size: 64, offset: 19072)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !313, file: !236, line: 185, baseType: !258, size: 64, offset: 19136)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !313, file: !236, line: 186, baseType: !258, size: 64, offset: 19200)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !313, file: !236, line: 188, baseType: !258, size: 64, offset: 19264)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !313, file: !236, line: 189, baseType: !260, size: 64, offset: 19328)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !313, file: !236, line: 190, baseType: !258, size: 64, offset: 19392)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !313, file: !236, line: 191, baseType: !258, size: 64, offset: 19456)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !313, file: !236, line: 197, baseType: !260, size: 64, offset: 19520)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !313, file: !236, line: 199, baseType: !258, size: 64, offset: 19584)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !313, file: !236, line: 200, baseType: !258, size: 64, offset: 19648)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !313, file: !236, line: 202, baseType: !364, size: 64, offset: 19712)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 40, baseType: !327)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !313, file: !236, line: 205, baseType: !368, size: 32, offset: 19776)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !24, line: 74, baseType: !45)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !313, file: !236, line: 206, baseType: !368, size: 32, offset: 19808)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !313, file: !236, line: 207, baseType: !45, size: 32, offset: 19840)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !313, file: !236, line: 208, baseType: !45, size: 32, offset: 19872)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !313, file: !236, line: 213, baseType: !29, size: 64, offset: 19904)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !313, file: !236, line: 214, baseType: !29, size: 64, offset: 19968)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !313, file: !236, line: 215, baseType: !29, size: 64, offset: 20032)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !313, file: !236, line: 216, baseType: !29, size: 64, offset: 20096)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !313, file: !236, line: 217, baseType: !29, size: 64, offset: 20160)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !313, file: !236, line: 218, baseType: !29, size: 64, offset: 20224)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !313, file: !236, line: 219, baseType: !29, size: 64, offset: 20288)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !313, file: !236, line: 220, baseType: !29, size: 64, offset: 20352)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !313, file: !236, line: 221, baseType: !29, size: 64, offset: 20416)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !313, file: !236, line: 222, baseType: !29, size: 64, offset: 20480)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !313, file: !236, line: 223, baseType: !29, size: 64, offset: 20544)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !313, file: !236, line: 226, baseType: !29, size: 64, offset: 20608)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !313, file: !236, line: 227, baseType: !29, size: 64, offset: 20672)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !313, file: !236, line: 228, baseType: !29, size: 64, offset: 20736)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !313, file: !236, line: 231, baseType: !29, size: 64, offset: 20800)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !313, file: !236, line: 232, baseType: !29, size: 64, offset: 20864)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !313, file: !236, line: 233, baseType: !29, size: 64, offset: 20928)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !313, file: !236, line: 234, baseType: !29, size: 64, offset: 20992)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !313, file: !236, line: 235, baseType: !29, size: 64, offset: 21056)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !313, file: !236, line: 236, baseType: !29, size: 64, offset: 21120)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !313, file: !236, line: 237, baseType: !29, size: 64, offset: 21184)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !313, file: !236, line: 238, baseType: !29, size: 64, offset: 21248)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !313, file: !236, line: 239, baseType: !29, size: 64, offset: 21312)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !313, file: !236, line: 240, baseType: !29, size: 64, offset: 21376)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !313, file: !236, line: 241, baseType: !29, size: 64, offset: 21440)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !313, file: !236, line: 242, baseType: !29, size: 64, offset: 21504)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !313, file: !236, line: 243, baseType: !29, size: 64, offset: 21568)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !313, file: !236, line: 244, baseType: !29, size: 64, offset: 21632)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !313, file: !236, line: 245, baseType: !29, size: 64, offset: 21696)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !313, file: !236, line: 246, baseType: !29, size: 64, offset: 21760)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !313, file: !236, line: 247, baseType: !29, size: 64, offset: 21824)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !313, file: !236, line: 248, baseType: !29, size: 64, offset: 21888)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !313, file: !236, line: 249, baseType: !29, size: 64, offset: 21952)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !313, file: !236, line: 250, baseType: !29, size: 64, offset: 22016)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !313, file: !236, line: 251, baseType: !29, size: 64, offset: 22080)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !313, file: !236, line: 253, baseType: !29, size: 64, offset: 22144)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !313, file: !236, line: 256, baseType: !29, size: 64, offset: 22208)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !313, file: !236, line: 257, baseType: !29, size: 64, offset: 22272)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !313, file: !236, line: 258, baseType: !29, size: 64, offset: 22336)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !313, file: !236, line: 259, baseType: !29, size: 64, offset: 22400)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !313, file: !236, line: 260, baseType: !29, size: 64, offset: 22464)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !313, file: !236, line: 261, baseType: !29, size: 64, offset: 22528)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !313, file: !236, line: 262, baseType: !29, size: 64, offset: 22592)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !313, file: !236, line: 264, baseType: !29, size: 64, offset: 22656)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !313, file: !236, line: 265, baseType: !29, size: 64, offset: 22720)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !313, file: !236, line: 266, baseType: !29, size: 64, offset: 22784)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !313, file: !236, line: 267, baseType: !29, size: 64, offset: 22848)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !313, file: !236, line: 268, baseType: !29, size: 64, offset: 22912)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !313, file: !236, line: 269, baseType: !29, size: 64, offset: 22976)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !313, file: !236, line: 270, baseType: !29, size: 64, offset: 23040)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !313, file: !236, line: 272, baseType: !29, size: 64, offset: 23104)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !313, file: !236, line: 273, baseType: !29, size: 64, offset: 23168)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !313, file: !236, line: 274, baseType: !29, size: 64, offset: 23232)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !313, file: !236, line: 275, baseType: !29, size: 64, offset: 23296)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !313, file: !236, line: 276, baseType: !29, size: 64, offset: 23360)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !313, file: !236, line: 277, baseType: !29, size: 64, offset: 23424)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !313, file: !236, line: 278, baseType: !29, size: 64, offset: 23488)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !313, file: !236, line: 279, baseType: !29, size: 64, offset: 23552)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !313, file: !236, line: 280, baseType: !29, size: 64, offset: 23616)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !313, file: !236, line: 281, baseType: !29, size: 64, offset: 23680)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !313, file: !236, line: 282, baseType: !29, size: 64, offset: 23744)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !313, file: !236, line: 283, baseType: !29, size: 64, offset: 23808)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !313, file: !236, line: 285, baseType: !29, size: 64, offset: 23872)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !313, file: !236, line: 286, baseType: !29, size: 64, offset: 23936)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !313, file: !236, line: 287, baseType: !29, size: 64, offset: 24000)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !313, file: !236, line: 288, baseType: !29, size: 64, offset: 24064)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !313, file: !236, line: 289, baseType: !29, size: 64, offset: 24128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !313, file: !236, line: 290, baseType: !29, size: 64, offset: 24192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !313, file: !236, line: 291, baseType: !29, size: 64, offset: 24256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !313, file: !236, line: 292, baseType: !29, size: 64, offset: 24320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !313, file: !236, line: 293, baseType: !29, size: 64, offset: 24384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !313, file: !236, line: 294, baseType: !29, size: 64, offset: 24448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !313, file: !236, line: 295, baseType: !29, size: 64, offset: 24512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !313, file: !236, line: 296, baseType: !29, size: 64, offset: 24576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !313, file: !236, line: 298, baseType: !29, size: 64, offset: 24640)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !313, file: !236, line: 299, baseType: !29, size: 64, offset: 24704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !313, file: !236, line: 301, baseType: !29, size: 64, offset: 24768)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !313, file: !236, line: 302, baseType: !29, size: 64, offset: 24832)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !313, file: !236, line: 303, baseType: !29, size: 64, offset: 24896)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !313, file: !236, line: 304, baseType: !29, size: 64, offset: 24960)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !313, file: !236, line: 305, baseType: !29, size: 64, offset: 25024)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !313, file: !236, line: 307, baseType: !29, size: 64, offset: 25088)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !313, file: !236, line: 308, baseType: !29, size: 64, offset: 25152)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !313, file: !236, line: 309, baseType: !29, size: 64, offset: 25216)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !313, file: !236, line: 310, baseType: !29, size: 64, offset: 25280)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !313, file: !236, line: 311, baseType: !29, size: 64, offset: 25344)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !313, file: !236, line: 316, baseType: !29, size: 64, offset: 25408)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !313, file: !236, line: 317, baseType: !29, size: 64, offset: 25472)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !313, file: !236, line: 318, baseType: !29, size: 64, offset: 25536)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !313, file: !236, line: 319, baseType: !29, size: 64, offset: 25600)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !313, file: !236, line: 322, baseType: !463, size: 896, offset: 25664)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !236, line: 149, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !236, line: 111, size: 896, elements: !465)
!465 = !{!466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !491, !492}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !464, file: !236, line: 112, baseType: !262, size: 16)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !464, file: !236, line: 113, baseType: !262, size: 16, offset: 16)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !464, file: !236, line: 114, baseType: !262, size: 16, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !464, file: !236, line: 115, baseType: !262, size: 16, offset: 48)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !464, file: !236, line: 116, baseType: !262, size: 16, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !464, file: !236, line: 117, baseType: !262, size: 16, offset: 80)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !464, file: !236, line: 118, baseType: !262, size: 16, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !464, file: !236, line: 119, baseType: !262, size: 16, offset: 112)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !464, file: !236, line: 120, baseType: !262, size: 16, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !464, file: !236, line: 121, baseType: !262, size: 16, offset: 144)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !464, file: !236, line: 122, baseType: !262, size: 16, offset: 160)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !464, file: !236, line: 123, baseType: !262, size: 16, offset: 176)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !464, file: !236, line: 124, baseType: !262, size: 16, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !464, file: !236, line: 125, baseType: !262, size: 16, offset: 208)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !464, file: !236, line: 127, baseType: !262, size: 16, offset: 224)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !464, file: !236, line: 128, baseType: !262, size: 16, offset: 240)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !464, file: !236, line: 130, baseType: !260, size: 64, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !464, file: !236, line: 131, baseType: !260, size: 64, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !464, file: !236, line: 132, baseType: !260, size: 64, offset: 384)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !464, file: !236, line: 135, baseType: !260, size: 64, offset: 448)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !464, file: !236, line: 138, baseType: !260, size: 64, offset: 512)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !464, file: !236, line: 141, baseType: !260, size: 64, offset: 576)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !464, file: !236, line: 142, baseType: !260, size: 64, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !464, file: !236, line: 145, baseType: !490, size: 64, offset: 704)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !464, file: !236, line: 146, baseType: !490, size: 64, offset: 768)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !464, file: !236, line: 148, baseType: !262, size: 16, offset: 832)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !232, file: !266, line: 380, type: !311, isLocal: false, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "utf8", scope: !232, file: !266, line: 387, type: !497, isLocal: true, isDefinition: true)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 48, elements: !342)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "ascii", scope: !232, file: !266, line: 388, type: !497, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "__code2flag", scope: !232, file: !266, line: 854, type: !502, isLocal: true, isDefinition: true)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 256, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 16)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !236, line: 324, baseType: !313)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "stdin", scope: !508, file: !509, line: 154, type: !513, isLocal: false, isDefinition: true)
!508 = distinct !DICompileUnit(language: DW_LANG_C99, file: !509, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !510, splitDebugInlining: false, nameTableKind: None)
!509 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!510 = !{!506, !511, !543, !545, !547, !549, !551}
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "stdout", scope: !508, file: !509, line: 155, type: !513, isLocal: false, isDefinition: true)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !515, line: 46, baseType: !516)
!515 = !DIFile(filename: "./include/stdio.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !517, line: 233, size: 704, elements: !518)
!517 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!518 = !{!519, !520, !524, !525, !526, !527, !528, !529, !530, !531, !533, !535, !542}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !516, file: !517, line: 234, baseType: !134, size: 16)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !516, file: !517, line: 237, baseType: !521, size: 16, offset: 16)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 16, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 2)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !516, file: !517, line: 244, baseType: !45, size: 32, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !516, file: !517, line: 246, baseType: !226, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !516, file: !517, line: 247, baseType: !226, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !516, file: !517, line: 248, baseType: !226, size: 64, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !516, file: !517, line: 249, baseType: !226, size: 64, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !516, file: !517, line: 252, baseType: !226, size: 64, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !516, file: !517, line: 255, baseType: !226, size: 64, offset: 384)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !516, file: !517, line: 261, baseType: !532, size: 64, offset: 448)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !516, file: !517, line: 268, baseType: !534, size: 64, offset: 512)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 64, elements: !522)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !516, file: !517, line: 271, baseType: !536, size: 64, offset: 576)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !537, line: 85, baseType: !538)
!537 = !DIFile(filename: "./include/wchar.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !537, line: 81, size: 64, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !538, file: !537, line: 83, baseType: !368, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !538, file: !537, line: 84, baseType: !368, size: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !516, file: !517, line: 274, baseType: !6, size: 64, offset: 640)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "stderr", scope: !508, file: !509, line: 156, type: !513, isLocal: false, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "__stdin", scope: !508, file: !509, line: 159, type: !513, isLocal: false, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "__stdout", scope: !508, file: !509, line: 162, type: !513, isLocal: false, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !508, file: !509, line: 180, type: !513, isLocal: false, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !508, file: !509, line: 131, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 2112, elements: !177)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !556, file: !557, line: 49, type: !45, isLocal: true, isDefinition: true)
!556 = distinct !DICompileUnit(language: DW_LANG_C99, file: !557, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !558, globals: !572, splitDebugInlining: false, nameTableKind: None)
!557 = !DIFile(filename: "libc/stdlib/abort.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!558 = !{!559, !6, !568}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !561, line: 50, baseType: !562)
!561 = !DIFile(filename: "./include/signal.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !563, line: 31, baseType: !564)
!563 = !DIFile(filename: "./include/bits/sigset.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !563, line: 28, size: 1024, elements: !565)
!565 = !{!566}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !564, file: !563, line: 30, baseType: !567, size: 1024)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, elements: !503)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !561, line: 75, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !45}
!572 = !{!554}
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "__exit_cleanup", scope: !575, file: !578, line: 309, type: !569, isLocal: false, isDefinition: true)
!575 = distinct !DICompileUnit(language: DW_LANG_C99, file: !576, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !577, splitDebugInlining: false, nameTableKind: None)
!576 = !DIFile(filename: "libc/stdlib/exit.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!577 = !{!573}
!578 = !DIFile(filename: "libc/stdlib/_atexit.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "stack_aux", scope: !581, file: !582, line: 53, type: !585, isLocal: false, isDefinition: true)
!581 = distinct !DICompileUnit(language: DW_LANG_C99, file: !582, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !583, globals: !621)
!582 = !DIFile(filename: "Proj1ASA.c", directory: "/home/framos/Sbugs/sbugs/Run_Projects/Projects/asa_1819_p1/tg001/preprocessed")
!583 = !{!584, !585, !592, !597, !616, !598, !607}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Stack", file: !582, line: 31, size: 192, elements: !587)
!587 = !{!588, !589, !590, !591}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !586, file: !582, line: 33, baseType: !45, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !586, file: !582, line: 34, baseType: !45, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !586, file: !582, line: 35, baseType: !45, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !586, file: !582, line: 36, baseType: !584, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Graph", file: !582, line: 8, size: 128, elements: !594)
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "numheads", scope: !593, file: !582, line: 10, baseType: !45, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !593, file: !582, line: 11, baseType: !597, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "router", file: !582, line: 19, size: 384, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606, !613, !614, !615}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "routerNumber", scope: !599, file: !582, line: 21, baseType: !45, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "scc_id", scope: !599, file: !582, line: 22, baseType: !45, size: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !599, file: !582, line: 23, baseType: !45, size: 32, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "instack", scope: !599, file: !582, line: 24, baseType: !45, size: 32, offset: 96)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "discoveryTime", scope: !599, file: !582, line: 25, baseType: !45, size: 32, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "adjVertex", scope: !599, file: !582, line: 26, baseType: !607, size: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge", file: !582, line: 38, size: 128, elements: !609)
!609 = !{!610, !611, !612}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "vNumber", scope: !608, file: !582, line: 40, baseType: !45, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !608, file: !582, line: 41, baseType: !45, size: 32, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "nextEdge", scope: !608, file: !582, line: 42, baseType: !607, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !599, file: !582, line: 27, baseType: !45, size: 32, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !599, file: !582, line: 28, baseType: !45, size: 32, offset: 288)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "connectionsSCC", scope: !599, file: !582, line: 29, baseType: !584, size: 64, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "connection", file: !582, line: 48, size: 64, elements: !618)
!618 = !{!619, !620}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !617, file: !582, line: 50, baseType: !45, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "destiny", scope: !617, file: !582, line: 51, baseType: !45, size: 32, offset: 32)
!621 = !{!579, !622, !624, !630, !632, !634, !636, !638, !640, !643, !653}
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "graph", scope: !581, file: !582, line: 54, type: !592, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "topologicalSort", scope: !581, file: !582, line: 55, type: !626, isLocal: false, isDefinition: true)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tpElement", file: !582, line: 44, size: 64, elements: !628)
!628 = !{!629}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !627, file: !582, line: 46, baseType: !584, size: 64)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "time", scope: !581, file: !582, line: 73, type: !45, isLocal: false, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "scc", scope: !581, file: !582, line: 74, type: !45, isLocal: false, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "connections", scope: !581, file: !582, line: 75, type: !45, isLocal: false, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "idAtual", scope: !581, file: !582, line: 76, type: !45, isLocal: false, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "min", scope: !581, file: !582, line: 77, type: !45, isLocal: false, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "connectionsArray", scope: !581, file: !582, line: 78, type: !642, isLocal: false, isDefinition: true)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "a", scope: !581, file: !582, line: 79, type: !645, isLocal: false, isDefinition: true)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "Array", file: !582, line: 18, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !582, line: 13, size: 192, elements: !647)
!647 = !{!648, !649, !652}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !646, file: !582, line: 15, baseType: !584, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !646, file: !582, line: 16, baseType: !650, size: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !651, line: 62, baseType: !10)
!651 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.0/include/stddef.h", directory: "/home/framos/Sbugs/sbugs/Run_Projects/Projects/asa_1819_p1/tg001/preprocessed")
!652 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !646, file: !582, line: 17, baseType: !650, size: 64, offset: 128)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "maxRouter", scope: !581, file: !582, line: 80, type: !45, isLocal: false, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "__exe_env", scope: !657, file: !662, line: 34, type: !709, isLocal: false, isDefinition: true)
!657 = distinct !DICompileUnit(language: DW_LANG_C89, file: !658, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !659, splitDebugInlining: false, nameTableKind: None)
!658 = !DIFile(filename: "/home/framos/Tools/Klee/klee/runtime/POSIX/fd_init.c", directory: "/home/framos/Tools/Klee/klee/build/runtime/POSIX")
!659 = !{!655, !660}
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "__exe_fs", scope: !657, file: !662, line: 21, type: !663, isLocal: false, isDefinition: true)
!662 = !DIFile(filename: "runtime/POSIX/fd_init.c", directory: "/home/framos/Tools/Klee/klee")
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_system_t", file: !101, line: 79, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !101, line: 67, size: 832, elements: !665)
!665 = !{!666, !667, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "n_sym_files", scope: !664, file: !101, line: 68, baseType: !102, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdin", scope: !664, file: !101, line: 69, baseType: !668, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_disk_file_t", file: !101, line: 49, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !101, line: 45, size: 192, elements: !671)
!671 = !{!672, !673, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !670, file: !101, line: 46, baseType: !102, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !670, file: !101, line: 47, baseType: !7, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !670, file: !101, line: 48, baseType: !675, size: 64, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !143, line: 119, size: 1152, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !690, !695, !696, !697}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !676, file: !143, line: 121, baseType: !146, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !676, file: !143, line: 123, baseType: !131, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !676, file: !143, line: 124, baseType: !150, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !676, file: !143, line: 125, baseType: !152, size: 32, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !676, file: !143, line: 132, baseType: !154, size: 32, offset: 224)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !676, file: !143, line: 133, baseType: !156, size: 32, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !676, file: !143, line: 135, baseType: !45, size: 32, offset: 288)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !676, file: !143, line: 136, baseType: !146, size: 64, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !676, file: !143, line: 137, baseType: !160, size: 64, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !676, file: !143, line: 143, baseType: !162, size: 64, offset: 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !676, file: !143, line: 144, baseType: !689, size: 64, offset: 512)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !125, line: 168, baseType: !121)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !676, file: !143, line: 152, baseType: !691, size: 128, offset: 576)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !167, line: 9, size: 128, elements: !692)
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !691, file: !167, line: 11, baseType: !170, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !691, file: !167, line: 12, baseType: !172, size: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !676, file: !143, line: 153, baseType: !691, size: 128, offset: 704)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !676, file: !143, line: 154, baseType: !691, size: 128, offset: 832)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !676, file: !143, line: 164, baseType: !176, size: 192, offset: 960)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdout", scope: !664, file: !101, line: 69, baseType: !668, size: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "stdout_writes", scope: !664, file: !101, line: 70, baseType: !102, size: 32, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "sym_files", scope: !664, file: !101, line: 71, baseType: !668, size: 64, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "max_failures", scope: !664, file: !101, line: 74, baseType: !102, size: 32, offset: 320)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "read_fail", scope: !664, file: !101, line: 77, baseType: !584, size: 64, offset: 384)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "write_fail", scope: !664, file: !101, line: 77, baseType: !584, size: 64, offset: 448)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "close_fail", scope: !664, file: !101, line: 77, baseType: !584, size: 64, offset: 512)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ftruncate_fail", scope: !664, file: !101, line: 77, baseType: !584, size: 64, offset: 576)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "getcwd_fail", scope: !664, file: !101, line: 77, baseType: !584, size: 64, offset: 640)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "chmod_fail", scope: !664, file: !101, line: 78, baseType: !584, size: 64, offset: 704)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "fchmod_fail", scope: !664, file: !101, line: 78, baseType: !584, size: 64, offset: 768)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_sym_env_t", file: !101, line: 94, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !101, line: 86, size: 6272, elements: !711)
!711 = !{!712, !723, !724, !725}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "fds", scope: !710, file: !101, line: 87, baseType: !713, size: 6144)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 6144, elements: !721)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_t", file: !101, line: 65, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !101, line: 58, size: 192, elements: !716)
!716 = !{!717, !718, !719, !720}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !715, file: !101, line: 59, baseType: !45, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !715, file: !101, line: 60, baseType: !102, size: 32, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !715, file: !101, line: 63, baseType: !122, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "dfile", scope: !715, file: !101, line: 64, baseType: !668, size: 64, offset: 128)
!721 = !{!722}
!722 = !DISubrange(count: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "umask", scope: !710, file: !101, line: 88, baseType: !204, size: 32, offset: 6144)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !710, file: !101, line: 89, baseType: !102, size: 32, offset: 6176)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "save_all_writes", scope: !710, file: !101, line: 93, baseType: !45, size: 32, offset: 6208)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "__locale_mmap", scope: !728, file: !729, line: 20149, type: !884, isLocal: false, isDefinition: true)
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !730, splitDebugInlining: false, nameTableKind: None)
!729 = !DIFile(filename: "extra/locale/locale_data.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!730 = !{!726, !731}
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "locale_mmap", scope: !728, file: !729, line: 11, type: !733, isLocal: true, isDefinition: true)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_mmap_t", file: !735, line: 91, baseType: !736)
!735 = !DIFile(filename: "./extra/locale/locale_mmap.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !735, line: 31, size: 2047232, elements: !737)
!737 = !{!738, !742, !746, !750, !754, !758, !762, !766, !770, !774, !778, !782, !786, !803, !805, !807, !809, !813, !815, !819, !823, !827, !831, !835, !839, !843, !847, !851, !855, !859, !860, !864, !868, !872, !876, !880}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !736, file: !735, line: 37, baseType: !739, size: 3360)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 3360, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 420)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !736, file: !735, line: 38, baseType: !743, size: 4032, offset: 3360)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 4032, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 504)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !736, file: !735, line: 40, baseType: !747, size: 28160, offset: 7392)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 28160, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 1760)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !736, file: !735, line: 41, baseType: !751, size: 36224, offset: 35552)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 36224, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 4528)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !736, file: !735, line: 46, baseType: !755, size: 28832, offset: 71776)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 28832, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 3604)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !736, file: !735, line: 47, baseType: !759, size: 13440, offset: 100608)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 13440, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 1680)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !736, file: !735, line: 48, baseType: !763, size: 3136, offset: 114048)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 3136, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 196)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_data", scope: !736, file: !735, line: 53, baseType: !767, size: 408, offset: 117184)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 408, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: 51)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_data", scope: !736, file: !735, line: 54, baseType: !771, size: 224, offset: 117592)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 224, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 28)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_data", scope: !736, file: !735, line: 55, baseType: !775, size: 13168, offset: 117816)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 13168, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 1646)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_data", scope: !736, file: !735, line: 56, baseType: !779, size: 226824, offset: 130984)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 226824, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 28353)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_data", scope: !736, file: !735, line: 58, baseType: !783, size: 14432, offset: 357808)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 14432, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 1804)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "codeset_8_bit", scope: !736, file: !735, line: 62, baseType: !787, size: 15824, offset: 372240)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !788, size: 15824, elements: !801)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "__codeset_8_bit_t", file: !790, line: 21, baseType: !791)
!790 = !DIFile(filename: "./extra/locale/c8tables.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !790, line: 16, size: 688, elements: !792)
!792 = !{!793, !795, !796, !797}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !791, file: !790, line: 17, baseType: !794, size: 128)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 128, elements: !503)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !791, file: !790, line: 18, baseType: !794, size: 128, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !791, file: !790, line: 19, baseType: !794, size: 128, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !791, file: !790, line: 20, baseType: !798, size: 304, offset: 384)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 304, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 38)
!801 = !{!802}
!802 = !DISubrange(count: 23)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_rows", scope: !736, file: !735, line: 65, baseType: !804, size: 160, offset: 388064)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 160, elements: !81)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_offsets", scope: !736, file: !735, line: 65, baseType: !806, size: 160, offset: 388224)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 160, elements: !350)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_idx", scope: !736, file: !735, line: 65, baseType: !808, size: 320, offset: 388384)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 320, elements: !81)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_rows", scope: !736, file: !735, line: 66, baseType: !810, size: 360, offset: 388704)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 360, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 45)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_offsets", scope: !736, file: !735, line: 66, baseType: !814, size: 48, offset: 389072)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 48, elements: !177)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_idx", scope: !736, file: !735, line: 66, baseType: !816, size: 240, offset: 389120)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 240, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 15)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_rows", scope: !736, file: !735, line: 67, baseType: !820, size: 31152, offset: 389360)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 31152, elements: !821)
!821 = !{!822}
!822 = !DISubrange(count: 3894)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_offsets", scope: !736, file: !735, line: 67, baseType: !824, size: 352, offset: 420512)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 352, elements: !825)
!825 = !{!826}
!826 = !DISubrange(count: 22)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_idx", scope: !736, file: !735, line: 67, baseType: !828, size: 6512, offset: 420864)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 6512, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 407)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_rows", scope: !736, file: !735, line: 68, baseType: !832, size: 66000, offset: 427376)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 66000, elements: !833)
!833 = !{!834}
!834 = !DISubrange(count: 8250)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_offsets", scope: !736, file: !735, line: 68, baseType: !836, size: 800, offset: 493376)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 800, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 50)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_idx", scope: !736, file: !735, line: 68, baseType: !840, size: 54864, offset: 494176)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 54864, elements: !841)
!841 = !{!842}
!842 = !DISubrange(count: 3429)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_rows", scope: !736, file: !735, line: 70, baseType: !844, size: 2976, offset: 549040)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 2976, elements: !845)
!845 = !{!846}
!846 = !DISubrange(count: 372)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_offsets", scope: !736, file: !735, line: 70, baseType: !848, size: 64, offset: 552016)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 64, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 4)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_idx", scope: !736, file: !735, line: 70, baseType: !852, size: 3200, offset: 552080)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 3200, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 200)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "collate_data", scope: !736, file: !735, line: 72, baseType: !856, size: 1458256, offset: 555280)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 1458256, elements: !857)
!857 = !{!858}
!858 = !DISubrange(count: 91141)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_item_offsets_LEN", scope: !736, file: !735, line: 74, baseType: !345, size: 48, offset: 2013536)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_tbl_offsets", scope: !736, file: !735, line: 75, baseType: !861, size: 1536, offset: 2013632)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1536, elements: !862)
!862 = !{!863}
!863 = !DISubrange(count: 24)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "locales", scope: !736, file: !735, line: 80, baseType: !865, size: 22608, offset: 2015168)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 22608, elements: !866)
!866 = !{!867}
!867 = !DISubrange(count: 2826)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "locale_names5", scope: !736, file: !735, line: 81, baseType: !869, size: 6680, offset: 2037776)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 6680, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 835)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "locale_at_modifiers", scope: !736, file: !735, line: 82, baseType: !873, size: 144, offset: 2044456)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 144, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 18)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "lc_names", scope: !736, file: !735, line: 85, baseType: !877, size: 552, offset: 2044600)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 552, elements: !878)
!878 = !{!879}
!879 = !DISubrange(count: 69)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "codeset_list", scope: !736, file: !735, line: 87, baseType: !881, size: 2040, offset: 2045152)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 2040, elements: !882)
!882 = !{!883}
!883 = !DISubrange(count: 255)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(name: "__C_ctype_b_data", scope: !887, file: !892, line: 471, type: !893, isLocal: false, isDefinition: true)
!887 = distinct !DICompileUnit(language: DW_LANG_C99, file: !888, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !889, splitDebugInlining: false, nameTableKind: None)
!888 = !DIFile(filename: "libc/misc/ctype/__C_ctype_b.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!889 = !{!885, !890}
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "__C_ctype_b", scope: !887, file: !892, line: 862, type: !316, isLocal: false, isDefinition: true)
!892 = !DIFile(filename: "libc/misc/ctype/ctype.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 6144, elements: !331)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "__C_ctype_tolower_data", scope: !896, file: !892, line: 878, type: !901, isLocal: false, isDefinition: true)
!896 = distinct !DICompileUnit(language: DW_LANG_C99, file: !897, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !898, splitDebugInlining: false, nameTableKind: None)
!897 = !DIFile(filename: "libc/misc/ctype/__C_ctype_tolower.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!898 = !{!894, !899}
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(name: "__C_ctype_tolower", scope: !896, file: !892, line: 981, type: !323, isLocal: false, isDefinition: true)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 6144, elements: !331)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "__C_ctype_toupper_data", scope: !904, file: !892, line: 1000, type: !901, isLocal: false, isDefinition: true)
!904 = distinct !DICompileUnit(language: DW_LANG_C99, file: !905, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !906, splitDebugInlining: false, nameTableKind: None)
!905 = !DIFile(filename: "libc/misc/ctype/__C_ctype_toupper.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!906 = !{!902, !907}
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(name: "__C_ctype_toupper", scope: !904, file: !892, line: 1103, type: !323, isLocal: false, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(name: "errno", scope: !911, file: !912, line: 7, type: !45, isLocal: false, isDefinition: true)
!911 = distinct !DICompileUnit(language: DW_LANG_C99, file: !912, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !913, splitDebugInlining: false, nameTableKind: None)
!912 = !DIFile(filename: "libc/misc/internals/errno.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!913 = !{!909, !914}
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(name: "h_errno", scope: !911, file: !912, line: 8, type: !45, isLocal: false, isDefinition: true)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "static_fd", scope: !918, file: !919, line: 39, type: !45, isLocal: true, isDefinition: true)
!918 = distinct !DICompileUnit(language: DW_LANG_C99, file: !919, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !920, globals: !956, splitDebugInlining: false, nameTableKind: None)
!919 = !DIFile(filename: "libc/misc/utmp/utent.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!920 = !{!6, !921, !924, !7}
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !922, line: 88, baseType: !923)
!922 = !DIFile(filename: "./include/sys/types.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !321, line: 145, baseType: !121)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmp", file: !926, line: 60, size: 3200, elements: !927)
!926 = !DIFile(filename: "./include/bits/utmp.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!927 = !{!928, !929, !932, !934, !936, !937, !938, !943, !944, !952, !955}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !925, file: !926, line: 62, baseType: !327, size: 16)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !925, file: !926, line: 63, baseType: !930, size: 32, offset: 32)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !922, line: 100, baseType: !931)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !321, line: 147, baseType: !45)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !925, file: !926, line: 64, baseType: !933, size: 256, offset: 64)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 256, elements: !721)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !925, file: !926, line: 65, baseType: !935, size: 32, offset: 320)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !849)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !925, file: !926, line: 66, baseType: !933, size: 256, offset: 352)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !925, file: !926, line: 67, baseType: !138, size: 2048, offset: 608)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !925, file: !926, line: 68, baseType: !939, size: 32, offset: 2656)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exit_status", file: !926, line: 52, size: 32, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !939, file: !926, line: 54, baseType: !327, size: 16)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !939, file: !926, line: 55, baseType: !327, size: 16, offset: 16)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !925, file: !926, line: 81, baseType: !121, size: 64, offset: 2688)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !925, file: !926, line: 82, baseType: !945, size: 128, offset: 2752)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !946, line: 73, size: 128, elements: !947)
!946 = !DIFile(filename: "./include/bits/time.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!947 = !{!948, !950}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !945, file: !946, line: 75, baseType: !949, size: 64)
