; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

module asm ".section .gnu.warning.siggetmask"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.__fpending"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.gets"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.tmpnam"
module asm "\09.previous"
module asm ""
module asm ".section .gnu.warning.mktemp"
module asm "\09.previous"

%struct.__uclibc_locale_struct.194 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.193 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!4 = !{}
!5 = !{!6, !7, !9, !11, !23, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !13, line: 1036, baseType: !14)
!13 = !DIFile(filename: "./include/elf.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1026, size: 128, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !14, file: !13, line: 1028, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 58, baseType: !10)
!18 = !DIFile(filename: "./include/stdint.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !14, file: !13, line: 1035, baseType: !20, size: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !13, line: 1029, size: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !20, file: !13, line: 1031, baseType: !17, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 46, baseType: !10)
!24 = !DIFile(filename: "/usr/lib/llvm-11/lib/clang/11.1.0/include/stddef.h", directory: "")
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!0, !27, !31, !33, !35, !38, !40, !46, !49}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !29, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !29, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !42, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !43, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "__evoke_link_warning_siggetmask", scope: !53, file: !54, line: 31, type: !56, isLocal: true, isDefinition: true)
!53 = distinct !DICompileUnit(language: DW_LANG_C99, file: !54, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !55, splitDebugInlining: false, nameTableKind: None)
!54 = !DIFile(filename: "libc/signal/siggetmask.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!55 = !{!51}
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 456, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 57)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "__evoke_link_warning___fpending", scope: !61, file: !62, line: 24, type: !64, isLocal: true, isDefinition: true)
!61 = distinct !DICompileUnit(language: DW_LANG_C99, file: !62, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !63, splitDebugInlining: false, nameTableKind: None)
!62 = !DIFile(filename: "libc/stdio/__fpending.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!63 = !{!59}
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 1336, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 167)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "__evoke_link_warning_gets", scope: !69, file: !70, line: 10, type: !56, isLocal: true, isDefinition: true)
!69 = distinct !DICompileUnit(language: DW_LANG_C99, file: !70, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !71, splitDebugInlining: false, nameTableKind: None)
!70 = !DIFile(filename: "libc/stdio/gets.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!71 = !{!67}
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "__evoke_link_warning_tmpnam", scope: !74, file: !75, line: 54, type: !83, isLocal: true, isDefinition: true)
!74 = distinct !DICompileUnit(language: DW_LANG_C99, file: !75, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !76, globals: !77, splitDebugInlining: false, nameTableKind: None)
!75 = !DIFile(filename: "libc/stdio/tmpnam.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!76 = !{!6, !7}
!77 = !{!72, !78}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "tmpnam_buffer", scope: !74, file: !75, line: 25, type: !80, isLocal: true, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 20)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 440, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 55)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "__evoke_link_warning_mktemp", scope: !88, file: !89, line: 35, type: !83, isLocal: true, isDefinition: true)
!88 = distinct !DICompileUnit(language: DW_LANG_C99, file: !89, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !90, splitDebugInlining: false, nameTableKind: None)
!89 = !DIFile(filename: "libc/stdlib/mktemp.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!90 = !{!86}
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "n_calls", scope: !93, file: !94, line: 1347, type: !45, isLocal: true, isDefinition: true)
!93 = distinct !DISubprogram(name: "getcwd", scope: !94, file: !94, line: 1346, type: !95, scopeLine: 1346, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!94 = !DIFile(filename: "runtime/POSIX/fd.c", directory: "/home/framos/Tools/Klee/klee")
!95 = !DISubroutineType(types: !96)
!96 = !{!7, !7, !23}
!97 = distinct !DICompileUnit(language: DW_LANG_C89, file: !98, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !99, retainedTypes: !120, globals: !179, splitDebugInlining: false, nameTableKind: None)
!98 = !DIFile(filename: "/home/framos/Tools/Klee/klee/runtime/POSIX/fd.c", directory: "/home/framos/Tools/Klee/klee/build/runtime/POSIX")
!99 = !{!100, !108}
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !101, line: 51, baseType: !102, size: 32, elements: !103)
!101 = !DIFile(filename: "runtime/POSIX/fd.h", directory: "/home/framos/Tools/Klee/klee")
!102 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!103 = !{!104, !105, !106, !107}
!104 = !DIEnumerator(name: "eOpen", value: 1, isUnsigned: true)
!105 = !DIEnumerator(name: "eCloseOnExec", value: 2, isUnsigned: true)
!106 = !DIEnumerator(name: "eReadable", value: 4, isUnsigned: true)
!107 = !DIEnumerator(name: "eWriteable", value: 8, isUnsigned: true)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !109, line: 97, baseType: !102, size: 32, elements: !110)
!109 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118, !119}
!111 = !DIEnumerator(name: "DT_UNKNOWN", value: 0, isUnsigned: true)
!112 = !DIEnumerator(name: "DT_FIFO", value: 1, isUnsigned: true)
!113 = !DIEnumerator(name: "DT_CHR", value: 2, isUnsigned: true)
!114 = !DIEnumerator(name: "DT_DIR", value: 4, isUnsigned: true)
!115 = !DIEnumerator(name: "DT_BLK", value: 6, isUnsigned: true)
!116 = !DIEnumerator(name: "DT_REG", value: 8, isUnsigned: true)
!117 = !DIEnumerator(name: "DT_LNK", value: 10, isUnsigned: true)
!118 = !DIEnumerator(name: "DT_SOCK", value: 12, isUnsigned: true)
!119 = !DIEnumerator(name: "DT_WHT", value: 14, isUnsigned: true)
!120 = !{!121, !6, !122, !10, !126, !7, !141, !45, !8}
!121 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !123, line: 93, baseType: !124)
!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !125, line: 141, baseType: !121)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !128, line: 37, size: 2240, elements: !129)
!128 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!129 = !{!130, !132, !133, !135, !137}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !127, file: !128, line: 39, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !125, line: 137, baseType: !10)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !127, file: !128, line: 40, baseType: !124, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !127, file: !128, line: 41, baseType: !134, size: 16, offset: 128)
!134 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !127, file: !128, line: 42, baseType: !136, size: 8, offset: 144)
!136 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !127, file: !128, line: 43, baseType: !138, size: 2048, offset: 152)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 256)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !143, line: 46, size: 1152, elements: !144)
!143 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!144 = !{!145, !147, !149, !151, !153, !155, !157, !158, !159, !161, !163, !165, !173, !174, !175}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !142, file: !143, line: 48, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !125, line: 133, baseType: !10)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !142, file: !143, line: 53, baseType: !148, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !125, line: 136, baseType: !10)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !142, file: !143, line: 61, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !125, line: 139, baseType: !10)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !142, file: !143, line: 62, baseType: !152, size: 32, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !125, line: 138, baseType: !102)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !142, file: !143, line: 64, baseType: !154, size: 32, offset: 224)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !125, line: 134, baseType: !102)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !142, file: !143, line: 65, baseType: !156, size: 32, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !125, line: 135, baseType: !102)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !142, file: !143, line: 67, baseType: !45, size: 32, offset: 288)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !142, file: !143, line: 69, baseType: !146, size: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !142, file: !143, line: 74, baseType: !160, size: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !125, line: 140, baseType: !121)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !142, file: !143, line: 78, baseType: !162, size: 64, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !125, line: 162, baseType: !121)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !142, file: !143, line: 80, baseType: !164, size: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !125, line: 167, baseType: !121)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !142, file: !143, line: 91, baseType: !166, size: 128, offset: 576)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !167, line: 9, size: 128, elements: !168)
!167 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!168 = !{!169, !171}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !166, file: !167, line: 11, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !125, line: 148, baseType: !121)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !166, file: !167, line: 12, baseType: !172, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !125, line: 184, baseType: !121)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !142, file: !143, line: 92, baseType: !166, size: 128, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !142, file: !143, line: 93, baseType: !166, size: 128, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !142, file: !143, line: 106, baseType: !176, size: 192, offset: 960)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 192, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 3)
!179 = !{!180, !185, !192, !199, !205, !210, !91}
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "n_calls", scope: !182, file: !94, line: 313, type: !45, isLocal: true, isDefinition: true)
!182 = distinct !DISubprogram(name: "close", scope: !94, file: !94, line: 312, type: !183, scopeLine: 312, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!183 = !DISubroutineType(types: !184)
!184 = !{!45, !45}
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "n_calls", scope: !187, file: !94, line: 345, type: !45, isLocal: true, isDefinition: true)
!187 = distinct !DISubprogram(name: "read", scope: !94, file: !94, line: 344, type: !188, scopeLine: 344, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!188 = !DISubroutineType(types: !189)
!189 = !{!190, !45, !6, !23}
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !123, line: 109, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !125, line: 181, baseType: !121)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "n_calls", scope: !194, file: !94, line: 411, type: !45, isLocal: true, isDefinition: true)
!194 = distinct !DISubprogram(name: "write", scope: !94, file: !94, line: 410, type: !195, scopeLine: 410, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!195 = !DISubroutineType(types: !196)
!196 = !{!190, !45, !197, !23}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "n_calls", scope: !201, file: !94, line: 647, type: !45, isLocal: true, isDefinition: true)
!201 = distinct !DISubprogram(name: "chmod", scope: !94, file: !94, line: 646, type: !202, scopeLine: 646, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!202 = !DISubroutineType(types: !203)
!203 = !{!45, !29, !204}
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !123, line: 70, baseType: !152)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "n_calls", scope: !207, file: !94, line: 666, type: !45, isLocal: true, isDefinition: true)
!207 = distinct !DISubprogram(name: "fchmod", scope: !94, file: !94, line: 665, type: !208, scopeLine: 665, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!208 = !DISubroutineType(types: !209)
!209 = !{!45, !45, !204}
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "n_calls", scope: !212, file: !94, line: 752, type: !45, isLocal: true, isDefinition: true)
!212 = distinct !DISubprogram(name: "__fd_ftruncate", scope: !94, file: !94, line: 751, type: !213, scopeLine: 751, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!213 = !DISubroutineType(types: !214)
!214 = !{!45, !45, !122}
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "letters", scope: !217, file: !218, line: 135, type: !227, isLocal: true, isDefinition: true)
!217 = distinct !DICompileUnit(language: DW_LANG_C99, file: !218, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !219, globals: !220, splitDebugInlining: false, nameTableKind: None)
!218 = !DIFile(filename: "libc/misc/internals/tempname.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!219 = !{!6, !17}
!220 = !{!221, !215}
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "value", scope: !223, file: !218, line: 159, type: !17, isLocal: true, isDefinition: true)
!223 = distinct !DISubprogram(name: "brain_damaged_fillrand", scope: !218, file: !218, line: 154, type: !224, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !217, retainedNodes: !4)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !226, !102}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 504, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 63)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !232, file: !266, line: 375, type: !505, isLocal: false, isDefinition: true)
!232 = distinct !DICompileUnit(language: DW_LANG_C99, file: !233, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !234, retainedTypes: !256, globals: !308, splitDebugInlining: false, nameTableKind: None)
!233 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!234 = !{!235, !241}
!235 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !236, line: 90, baseType: !102, size: 32, elements: !237)
!236 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!237 = !{!238, !239, !240}
!238 = !DIEnumerator(name: "__ctype_encoding_7_bit", value: 0, isUnsigned: true)
!239 = !DIEnumerator(name: "__ctype_encoding_utf8", value: 1, isUnsigned: true)
!240 = !DIEnumerator(name: "__ctype_encoding_8_bit", value: 2, isUnsigned: true)
!241 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !242, line: 48, baseType: !102, size: 32, elements: !243)
!242 = !DIFile(filename: "./include/ctype.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!243 = !{!244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!244 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!245 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!246 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!247 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!248 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!249 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!250 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!251 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!252 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!253 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!254 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!255 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!256 = !{!45, !257, !7, !258, !260, !263, !136, !226, !264, !277, !285, !10}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 52, baseType: !134)
!263 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !266, line: 400, baseType: !267)
!266 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !266, line: 390, size: 128, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !267, file: !266, line: 391, baseType: !262, size: 16)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !267, file: !266, line: 392, baseType: !262, size: 16, offset: 16)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !267, file: !266, line: 393, baseType: !262, size: 16, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !267, file: !266, line: 394, baseType: !262, size: 16, offset: 48)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !267, file: !266, line: 396, baseType: !262, size: 16, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !267, file: !266, line: 397, baseType: !262, size: 16, offset: 80)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !267, file: !266, line: 398, baseType: !262, size: 16, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !267, file: !266, line: 399, baseType: !262, size: 16, offset: 112)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !266, line: 430, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !266, line: 425, size: 64, elements: !280)
!280 = !{!281, !282, !283, !284}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !279, file: !266, line: 426, baseType: !262, size: 16)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !279, file: !266, line: 427, baseType: !262, size: 16, offset: 16)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !279, file: !266, line: 428, baseType: !262, size: 16, offset: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !279, file: !266, line: 429, baseType: !262, size: 16, offset: 48)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !266, line: 423, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !266, line: 402, size: 304, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !287, file: !266, line: 403, baseType: !262, size: 16)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !287, file: !266, line: 404, baseType: !262, size: 16, offset: 16)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !287, file: !266, line: 405, baseType: !262, size: 16, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !287, file: !266, line: 406, baseType: !262, size: 16, offset: 48)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !287, file: !266, line: 407, baseType: !262, size: 16, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !287, file: !266, line: 408, baseType: !262, size: 16, offset: 80)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !287, file: !266, line: 409, baseType: !262, size: 16, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !287, file: !266, line: 410, baseType: !262, size: 16, offset: 112)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !287, file: !266, line: 411, baseType: !262, size: 16, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !287, file: !266, line: 412, baseType: !262, size: 16, offset: 144)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !287, file: !266, line: 413, baseType: !262, size: 16, offset: 160)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !287, file: !266, line: 414, baseType: !262, size: 16, offset: 176)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !287, file: !266, line: 415, baseType: !262, size: 16, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !287, file: !266, line: 416, baseType: !262, size: 16, offset: 208)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !287, file: !266, line: 418, baseType: !262, size: 16, offset: 224)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !287, file: !266, line: 419, baseType: !262, size: 16, offset: 240)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !287, file: !266, line: 420, baseType: !262, size: 16, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !287, file: !266, line: 421, baseType: !262, size: 16, offset: 272)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !287, file: !266, line: 422, baseType: !262, size: 16, offset: 288)
!308 = !{!309, !493, !230, !495, !498, !500}
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "__global_locale", scope: !232, file: !266, line: 377, type: !311, isLocal: false, isDefinition: true)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !236, line: 330, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !236, line: 154, size: 26560, elements: !314)
!314 = !{!315, !322, !328, !329, !333, !335, !336, !340, !344, !346, !347, !348, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !367, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !313, file: !236, line: 156, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !319, line: 38, baseType: !320)
!319 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !321, line: 44, baseType: !134)
!321 = !DIFile(filename: "./include/bits/types.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !313, file: !236, line: 157, baseType: !323, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !319, line: 42, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !321, line: 43, baseType: !327)
!327 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !313, file: !236, line: 158, baseType: !323, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !313, file: !236, line: 162, baseType: !330, size: 6144, offset: 192)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 6144, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !313, file: !236, line: 163, baseType: !334, size: 6144, offset: 6336)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 6144, elements: !331)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !313, file: !236, line: 164, baseType: !334, size: 6144, offset: 12480)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !313, file: !236, line: 168, baseType: !337, size: 112, offset: 18624)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 112, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 14)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !313, file: !236, line: 174, baseType: !341, size: 96, offset: 18736)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 96, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 6)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !313, file: !236, line: 175, baseType: !345, size: 48, offset: 18832)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 48, elements: !342)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !313, file: !236, line: 178, baseType: !136, size: 8, offset: 18880)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !313, file: !236, line: 179, baseType: !136, size: 8, offset: 18888)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !313, file: !236, line: 180, baseType: !349, size: 80, offset: 18896)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 80, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 10)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !313, file: !236, line: 183, baseType: !258, size: 64, offset: 19008)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !313, file: !236, line: 184, baseType: !258, size: 64, offset: 19072)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !313, file: !236, line: 185, baseType: !258, size: 64, offset: 19136)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !313, file: !236, line: 186, baseType: !258, size: 64, offset: 19200)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !313, file: !236, line: 188, baseType: !258, size: 64, offset: 19264)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !313, file: !236, line: 189, baseType: !260, size: 64, offset: 19328)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !313, file: !236, line: 190, baseType: !258, size: 64, offset: 19392)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !313, file: !236, line: 191, baseType: !258, size: 64, offset: 19456)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !313, file: !236, line: 197, baseType: !260, size: 64, offset: 19520)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !313, file: !236, line: 199, baseType: !258, size: 64, offset: 19584)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !313, file: !236, line: 200, baseType: !258, size: 64, offset: 19648)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !313, file: !236, line: 202, baseType: !364, size: 64, offset: 19712)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 40, baseType: !327)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !313, file: !236, line: 205, baseType: !368, size: 32, offset: 19776)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !24, line: 74, baseType: !45)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !313, file: !236, line: 206, baseType: !368, size: 32, offset: 19808)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !313, file: !236, line: 207, baseType: !45, size: 32, offset: 19840)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !313, file: !236, line: 208, baseType: !45, size: 32, offset: 19872)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !313, file: !236, line: 213, baseType: !29, size: 64, offset: 19904)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !313, file: !236, line: 214, baseType: !29, size: 64, offset: 19968)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !313, file: !236, line: 215, baseType: !29, size: 64, offset: 20032)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !313, file: !236, line: 216, baseType: !29, size: 64, offset: 20096)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !313, file: !236, line: 217, baseType: !29, size: 64, offset: 20160)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !313, file: !236, line: 218, baseType: !29, size: 64, offset: 20224)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !313, file: !236, line: 219, baseType: !29, size: 64, offset: 20288)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !313, file: !236, line: 220, baseType: !29, size: 64, offset: 20352)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !313, file: !236, line: 221, baseType: !29, size: 64, offset: 20416)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !313, file: !236, line: 222, baseType: !29, size: 64, offset: 20480)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !313, file: !236, line: 223, baseType: !29, size: 64, offset: 20544)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !313, file: !236, line: 226, baseType: !29, size: 64, offset: 20608)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !313, file: !236, line: 227, baseType: !29, size: 64, offset: 20672)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !313, file: !236, line: 228, baseType: !29, size: 64, offset: 20736)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !313, file: !236, line: 231, baseType: !29, size: 64, offset: 20800)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !313, file: !236, line: 232, baseType: !29, size: 64, offset: 20864)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !313, file: !236, line: 233, baseType: !29, size: 64, offset: 20928)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !313, file: !236, line: 234, baseType: !29, size: 64, offset: 20992)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !313, file: !236, line: 235, baseType: !29, size: 64, offset: 21056)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !313, file: !236, line: 236, baseType: !29, size: 64, offset: 21120)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !313, file: !236, line: 237, baseType: !29, size: 64, offset: 21184)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !313, file: !236, line: 238, baseType: !29, size: 64, offset: 21248)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !313, file: !236, line: 239, baseType: !29, size: 64, offset: 21312)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !313, file: !236, line: 240, baseType: !29, size: 64, offset: 21376)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !313, file: !236, line: 241, baseType: !29, size: 64, offset: 21440)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !313, file: !236, line: 242, baseType: !29, size: 64, offset: 21504)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !313, file: !236, line: 243, baseType: !29, size: 64, offset: 21568)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !313, file: !236, line: 244, baseType: !29, size: 64, offset: 21632)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !313, file: !236, line: 245, baseType: !29, size: 64, offset: 21696)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !313, file: !236, line: 246, baseType: !29, size: 64, offset: 21760)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !313, file: !236, line: 247, baseType: !29, size: 64, offset: 21824)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !313, file: !236, line: 248, baseType: !29, size: 64, offset: 21888)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !313, file: !236, line: 249, baseType: !29, size: 64, offset: 21952)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !313, file: !236, line: 250, baseType: !29, size: 64, offset: 22016)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !313, file: !236, line: 251, baseType: !29, size: 64, offset: 22080)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !313, file: !236, line: 253, baseType: !29, size: 64, offset: 22144)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !313, file: !236, line: 256, baseType: !29, size: 64, offset: 22208)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !313, file: !236, line: 257, baseType: !29, size: 64, offset: 22272)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !313, file: !236, line: 258, baseType: !29, size: 64, offset: 22336)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !313, file: !236, line: 259, baseType: !29, size: 64, offset: 22400)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !313, file: !236, line: 260, baseType: !29, size: 64, offset: 22464)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !313, file: !236, line: 261, baseType: !29, size: 64, offset: 22528)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !313, file: !236, line: 262, baseType: !29, size: 64, offset: 22592)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !313, file: !236, line: 264, baseType: !29, size: 64, offset: 22656)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !313, file: !236, line: 265, baseType: !29, size: 64, offset: 22720)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !313, file: !236, line: 266, baseType: !29, size: 64, offset: 22784)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !313, file: !236, line: 267, baseType: !29, size: 64, offset: 22848)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !313, file: !236, line: 268, baseType: !29, size: 64, offset: 22912)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !313, file: !236, line: 269, baseType: !29, size: 64, offset: 22976)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !313, file: !236, line: 270, baseType: !29, size: 64, offset: 23040)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !313, file: !236, line: 272, baseType: !29, size: 64, offset: 23104)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !313, file: !236, line: 273, baseType: !29, size: 64, offset: 23168)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !313, file: !236, line: 274, baseType: !29, size: 64, offset: 23232)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !313, file: !236, line: 275, baseType: !29, size: 64, offset: 23296)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !313, file: !236, line: 276, baseType: !29, size: 64, offset: 23360)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !313, file: !236, line: 277, baseType: !29, size: 64, offset: 23424)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !313, file: !236, line: 278, baseType: !29, size: 64, offset: 23488)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !313, file: !236, line: 279, baseType: !29, size: 64, offset: 23552)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !313, file: !236, line: 280, baseType: !29, size: 64, offset: 23616)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !313, file: !236, line: 281, baseType: !29, size: 64, offset: 23680)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !313, file: !236, line: 282, baseType: !29, size: 64, offset: 23744)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !313, file: !236, line: 283, baseType: !29, size: 64, offset: 23808)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !313, file: !236, line: 285, baseType: !29, size: 64, offset: 23872)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !313, file: !236, line: 286, baseType: !29, size: 64, offset: 23936)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !313, file: !236, line: 287, baseType: !29, size: 64, offset: 24000)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !313, file: !236, line: 288, baseType: !29, size: 64, offset: 24064)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !313, file: !236, line: 289, baseType: !29, size: 64, offset: 24128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !313, file: !236, line: 290, baseType: !29, size: 64, offset: 24192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !313, file: !236, line: 291, baseType: !29, size: 64, offset: 24256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !313, file: !236, line: 292, baseType: !29, size: 64, offset: 24320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !313, file: !236, line: 293, baseType: !29, size: 64, offset: 24384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !313, file: !236, line: 294, baseType: !29, size: 64, offset: 24448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !313, file: !236, line: 295, baseType: !29, size: 64, offset: 24512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !313, file: !236, line: 296, baseType: !29, size: 64, offset: 24576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !313, file: !236, line: 298, baseType: !29, size: 64, offset: 24640)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !313, file: !236, line: 299, baseType: !29, size: 64, offset: 24704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !313, file: !236, line: 301, baseType: !29, size: 64, offset: 24768)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !313, file: !236, line: 302, baseType: !29, size: 64, offset: 24832)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !313, file: !236, line: 303, baseType: !29, size: 64, offset: 24896)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !313, file: !236, line: 304, baseType: !29, size: 64, offset: 24960)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !313, file: !236, line: 305, baseType: !29, size: 64, offset: 25024)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !313, file: !236, line: 307, baseType: !29, size: 64, offset: 25088)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !313, file: !236, line: 308, baseType: !29, size: 64, offset: 25152)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !313, file: !236, line: 309, baseType: !29, size: 64, offset: 25216)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !313, file: !236, line: 310, baseType: !29, size: 64, offset: 25280)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !313, file: !236, line: 311, baseType: !29, size: 64, offset: 25344)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !313, file: !236, line: 316, baseType: !29, size: 64, offset: 25408)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !313, file: !236, line: 317, baseType: !29, size: 64, offset: 25472)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !313, file: !236, line: 318, baseType: !29, size: 64, offset: 25536)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !313, file: !236, line: 319, baseType: !29, size: 64, offset: 25600)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !313, file: !236, line: 322, baseType: !463, size: 896, offset: 25664)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !236, line: 149, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !236, line: 111, size: 896, elements: !465)
!465 = !{!466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !491, !492}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !464, file: !236, line: 112, baseType: !262, size: 16)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !464, file: !236, line: 113, baseType: !262, size: 16, offset: 16)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !464, file: !236, line: 114, baseType: !262, size: 16, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !464, file: !236, line: 115, baseType: !262, size: 16, offset: 48)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !464, file: !236, line: 116, baseType: !262, size: 16, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !464, file: !236, line: 117, baseType: !262, size: 16, offset: 80)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !464, file: !236, line: 118, baseType: !262, size: 16, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !464, file: !236, line: 119, baseType: !262, size: 16, offset: 112)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !464, file: !236, line: 120, baseType: !262, size: 16, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !464, file: !236, line: 121, baseType: !262, size: 16, offset: 144)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !464, file: !236, line: 122, baseType: !262, size: 16, offset: 160)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !464, file: !236, line: 123, baseType: !262, size: 16, offset: 176)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !464, file: !236, line: 124, baseType: !262, size: 16, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !464, file: !236, line: 125, baseType: !262, size: 16, offset: 208)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !464, file: !236, line: 127, baseType: !262, size: 16, offset: 224)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !464, file: !236, line: 128, baseType: !262, size: 16, offset: 240)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !464, file: !236, line: 130, baseType: !260, size: 64, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !464, file: !236, line: 131, baseType: !260, size: 64, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !464, file: !236, line: 132, baseType: !260, size: 64, offset: 384)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !464, file: !236, line: 135, baseType: !260, size: 64, offset: 448)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !464, file: !236, line: 138, baseType: !260, size: 64, offset: 512)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !464, file: !236, line: 141, baseType: !260, size: 64, offset: 576)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !464, file: !236, line: 142, baseType: !260, size: 64, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !464, file: !236, line: 145, baseType: !490, size: 64, offset: 704)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !464, file: !236, line: 146, baseType: !490, size: 64, offset: 768)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !464, file: !236, line: 148, baseType: !262, size: 16, offset: 832)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !232, file: !266, line: 380, type: !311, isLocal: false, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "utf8", scope: !232, file: !266, line: 387, type: !497, isLocal: true, isDefinition: true)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 48, elements: !342)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "ascii", scope: !232, file: !266, line: 388, type: !497, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "__code2flag", scope: !232, file: !266, line: 854, type: !502, isLocal: true, isDefinition: true)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 256, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 16)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !236, line: 324, baseType: !313)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "stdin", scope: !508, file: !509, line: 154, type: !513, isLocal: false, isDefinition: true)
!508 = distinct !DICompileUnit(language: DW_LANG_C99, file: !509, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !510, splitDebugInlining: false, nameTableKind: None)
!509 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!510 = !{!506, !511, !543, !545, !547, !549, !551}
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "stdout", scope: !508, file: !509, line: 155, type: !513, isLocal: false, isDefinition: true)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !515, line: 46, baseType: !516)
!515 = !DIFile(filename: "./include/stdio.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !517, line: 233, size: 704, elements: !518)
!517 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!518 = !{!519, !520, !524, !525, !526, !527, !528, !529, !530, !531, !533, !535, !542}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !516, file: !517, line: 234, baseType: !134, size: 16)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !516, file: !517, line: 237, baseType: !521, size: 16, offset: 16)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 16, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 2)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !516, file: !517, line: 244, baseType: !45, size: 32, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !516, file: !517, line: 246, baseType: !226, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !516, file: !517, line: 247, baseType: !226, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !516, file: !517, line: 248, baseType: !226, size: 64, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !516, file: !517, line: 249, baseType: !226, size: 64, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !516, file: !517, line: 252, baseType: !226, size: 64, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !516, file: !517, line: 255, baseType: !226, size: 64, offset: 384)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !516, file: !517, line: 261, baseType: !532, size: 64, offset: 448)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !516, file: !517, line: 268, baseType: !534, size: 64, offset: 512)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 64, elements: !522)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !516, file: !517, line: 271, baseType: !536, size: 64, offset: 576)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !537, line: 85, baseType: !538)
!537 = !DIFile(filename: "./include/wchar.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !537, line: 81, size: 64, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !538, file: !537, line: 83, baseType: !368, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !538, file: !537, line: 84, baseType: !368, size: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !516, file: !517, line: 274, baseType: !6, size: 64, offset: 640)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "stderr", scope: !508, file: !509, line: 156, type: !513, isLocal: false, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "__stdin", scope: !508, file: !509, line: 159, type: !513, isLocal: false, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "__stdout", scope: !508, file: !509, line: 162, type: !513, isLocal: false, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !508, file: !509, line: 180, type: !513, isLocal: false, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !508, file: !509, line: 131, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 2112, elements: !177)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !556, file: !557, line: 49, type: !45, isLocal: true, isDefinition: true)
!556 = distinct !DICompileUnit(language: DW_LANG_C99, file: !557, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !558, globals: !572, splitDebugInlining: false, nameTableKind: None)
!557 = !DIFile(filename: "libc/stdlib/abort.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!558 = !{!559, !6, !568}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !561, line: 50, baseType: !562)
!561 = !DIFile(filename: "./include/signal.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !563, line: 31, baseType: !564)
!563 = !DIFile(filename: "./include/bits/sigset.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !563, line: 28, size: 1024, elements: !565)
!565 = !{!566}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !564, file: !563, line: 30, baseType: !567, size: 1024)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, elements: !503)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !561, line: 75, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !45}
!572 = !{!554}
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "__exit_cleanup", scope: !575, file: !578, line: 309, type: !569, isLocal: false, isDefinition: true)
!575 = distinct !DICompileUnit(language: DW_LANG_C99, file: !576, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !577, splitDebugInlining: false, nameTableKind: None)
!576 = !DIFile(filename: "libc/stdlib/exit.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!577 = !{!573}
!578 = !DIFile(filename: "libc/stdlib/_atexit.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "products", scope: !581, file: !582, line: 10, type: !608, isLocal: false, isDefinition: true)
!581 = distinct !DICompileUnit(language: DW_LANG_C99, file: !582, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !583)
!582 = !DIFile(filename: "products.c", directory: "/home/framos/Sbugs/sbugs/Run_Projects/Projects/iaed_p1/186/preprocessed")
!583 = !{!579, !584, !586, !606}
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "productCount", scope: !581, file: !582, line: 11, type: !45, isLocal: false, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "packages", scope: !581, file: !588, line: 9, type: !589, isLocal: false, isDefinition: true)
!588 = !DIFile(filename: "./packages.h", directory: "/home/framos/Sbugs/sbugs/Run_Projects/Projects/iaed_p1/186/preprocessed")
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 67200000, elements: !603)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "Product", file: !591, line: 16, baseType: !592)
!591 = !DIFile(filename: "./products.h", directory: "/home/framos/Sbugs/sbugs/Run_Projects/Projects/iaed_p1/186/preprocessed")
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !591, line: 8, size: 672, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !592, file: !591, line: 10, baseType: !45, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "alive", scope: !592, file: !591, line: 11, baseType: !45, size: 32, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "price", scope: !592, file: !591, line: 12, baseType: !45, size: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !592, file: !591, line: 13, baseType: !45, size: 32, offset: 96)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "quantity", scope: !592, file: !591, line: 14, baseType: !45, size: 32, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !592, file: !591, line: 15, baseType: !600, size: 512, offset: 160)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 512, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 64, lowerBound: 0)
!603 = !{!604, !605}
!604 = !DISubrange(count: 500, lowerBound: 0)
!605 = !DISubrange(count: 200, lowerBound: 0)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "packageCount", scope: !581, file: !588, line: 10, type: !45, isLocal: false, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 6720000, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 10000, lowerBound: 0)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "packages", scope: !613, file: !614, line: 10, type: !632, isLocal: false, isDefinition: true)
!613 = distinct !DICompileUnit(language: DW_LANG_C99, file: !614, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !615)
!614 = !DIFile(filename: "packages.c", directory: "/home/framos/Sbugs/sbugs/Run_Projects/Projects/iaed_p1/186/preprocessed")
!615 = !{!611, !616, !618, !630}
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "packageCount", scope: !613, file: !614, line: 11, type: !45, isLocal: false, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "products", scope: !613, file: !591, line: 17, type: !620, isLocal: false, isDefinition: true)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 6720000, elements: !609)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "Product", file: !591, line: 16, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !591, line: 8, size: 672, elements: !623)
!623 = !{!624, !625, !626, !627, !628, !629}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !622, file: !591, line: 10, baseType: !45, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "alive", scope: !622, file: !591, line: 11, baseType: !45, size: 32, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "price", scope: !622, file: !591, line: 12, baseType: !45, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !622, file: !591, line: 13, baseType: !45, size: 32, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "quantity", scope: !622, file: !591, line: 14, baseType: !45, size: 32, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !622, file: !591, line: 15, baseType: !600, size: 512, offset: 160)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "productCount", scope: !613, file: !591, line: 18, type: !45, isLocal: false, isDefinition: true)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 67200000, elements: !603)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "__exe_env", scope: !635, file: !640, line: 34, type: !688, isLocal: false, isDefinition: true)
!635 = distinct !DICompileUnit(language: DW_LANG_C89, file: !636, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !637, splitDebugInlining: false, nameTableKind: None)
!636 = !DIFile(filename: "/home/framos/Tools/Klee/klee/runtime/POSIX/fd_init.c", directory: "/home/framos/Tools/Klee/klee/build/runtime/POSIX")
!637 = !{!633, !638}
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "__exe_fs", scope: !635, file: !640, line: 21, type: !641, isLocal: false, isDefinition: true)
!640 = !DIFile(filename: "runtime/POSIX/fd_init.c", directory: "/home/framos/Tools/Klee/klee")
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_system_t", file: !101, line: 79, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !101, line: 67, size: 832, elements: !643)
!643 = !{!644, !645, !676, !677, !678, !679, !680, !682, !683, !684, !685, !686, !687}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "n_sym_files", scope: !642, file: !101, line: 68, baseType: !102, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdin", scope: !642, file: !101, line: 69, baseType: !646, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_disk_file_t", file: !101, line: 49, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !101, line: 45, size: 192, elements: !649)
!649 = !{!650, !651, !652}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !648, file: !101, line: 46, baseType: !102, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !648, file: !101, line: 47, baseType: !7, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !648, file: !101, line: 48, baseType: !653, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !143, line: 119, size: 1152, elements: !655)
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !668, !673, !674, !675}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !654, file: !143, line: 121, baseType: !146, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !654, file: !143, line: 123, baseType: !131, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !654, file: !143, line: 124, baseType: !150, size: 64, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !654, file: !143, line: 125, baseType: !152, size: 32, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !654, file: !143, line: 132, baseType: !154, size: 32, offset: 224)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !654, file: !143, line: 133, baseType: !156, size: 32, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !654, file: !143, line: 135, baseType: !45, size: 32, offset: 288)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !654, file: !143, line: 136, baseType: !146, size: 64, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !654, file: !143, line: 137, baseType: !160, size: 64, offset: 384)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !654, file: !143, line: 143, baseType: !162, size: 64, offset: 448)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !654, file: !143, line: 144, baseType: !667, size: 64, offset: 512)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !125, line: 168, baseType: !121)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !654, file: !143, line: 152, baseType: !669, size: 128, offset: 576)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !167, line: 9, size: 128, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !669, file: !167, line: 11, baseType: !170, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !669, file: !167, line: 12, baseType: !172, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !654, file: !143, line: 153, baseType: !669, size: 128, offset: 704)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !654, file: !143, line: 154, baseType: !669, size: 128, offset: 832)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !654, file: !143, line: 164, baseType: !176, size: 192, offset: 960)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdout", scope: !642, file: !101, line: 69, baseType: !646, size: 64, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "stdout_writes", scope: !642, file: !101, line: 70, baseType: !102, size: 32, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "sym_files", scope: !642, file: !101, line: 71, baseType: !646, size: 64, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "max_failures", scope: !642, file: !101, line: 74, baseType: !102, size: 32, offset: 320)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "read_fail", scope: !642, file: !101, line: 77, baseType: !681, size: 64, offset: 384)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "write_fail", scope: !642, file: !101, line: 77, baseType: !681, size: 64, offset: 448)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "close_fail", scope: !642, file: !101, line: 77, baseType: !681, size: 64, offset: 512)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ftruncate_fail", scope: !642, file: !101, line: 77, baseType: !681, size: 64, offset: 576)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "getcwd_fail", scope: !642, file: !101, line: 77, baseType: !681, size: 64, offset: 640)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "chmod_fail", scope: !642, file: !101, line: 78, baseType: !681, size: 64, offset: 704)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "fchmod_fail", scope: !642, file: !101, line: 78, baseType: !681, size: 64, offset: 768)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_sym_env_t", file: !101, line: 94, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !101, line: 86, size: 6272, elements: !690)
!690 = !{!691, !702, !703, !704}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "fds", scope: !689, file: !101, line: 87, baseType: !692, size: 6144)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !693, size: 6144, elements: !700)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_t", file: !101, line: 65, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !101, line: 58, size: 192, elements: !695)
!695 = !{!696, !697, !698, !699}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !694, file: !101, line: 59, baseType: !45, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !694, file: !101, line: 60, baseType: !102, size: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !694, file: !101, line: 63, baseType: !122, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "dfile", scope: !694, file: !101, line: 64, baseType: !646, size: 64, offset: 128)
!700 = !{!701}
!701 = !DISubrange(count: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "umask", scope: !689, file: !101, line: 88, baseType: !204, size: 32, offset: 6144)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !689, file: !101, line: 89, baseType: !102, size: 32, offset: 6176)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "save_all_writes", scope: !689, file: !101, line: 93, baseType: !45, size: 32, offset: 6208)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "__locale_mmap", scope: !707, file: !708, line: 20149, type: !863, isLocal: false, isDefinition: true)
!707 = distinct !DICompileUnit(language: DW_LANG_C99, file: !708, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !709, splitDebugInlining: false, nameTableKind: None)
!708 = !DIFile(filename: "extra/locale/locale_data.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!709 = !{!705, !710}
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "locale_mmap", scope: !707, file: !708, line: 11, type: !712, isLocal: true, isDefinition: true)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_mmap_t", file: !714, line: 91, baseType: !715)
!714 = !DIFile(filename: "./extra/locale/locale_mmap.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !714, line: 31, size: 2047232, elements: !716)
!716 = !{!717, !721, !725, !729, !733, !737, !741, !745, !749, !753, !757, !761, !765, !782, !784, !786, !788, !792, !794, !798, !802, !806, !810, !814, !818, !822, !826, !830, !834, !838, !839, !843, !847, !851, !855, !859}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !715, file: !714, line: 37, baseType: !718, size: 3360)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 3360, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 420)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !715, file: !714, line: 38, baseType: !722, size: 4032, offset: 3360)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 4032, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 504)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !715, file: !714, line: 40, baseType: !726, size: 28160, offset: 7392)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 28160, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 1760)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !715, file: !714, line: 41, baseType: !730, size: 36224, offset: 35552)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 36224, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 4528)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !715, file: !714, line: 46, baseType: !734, size: 28832, offset: 71776)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 28832, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 3604)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !715, file: !714, line: 47, baseType: !738, size: 13440, offset: 100608)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 13440, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 1680)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !715, file: !714, line: 48, baseType: !742, size: 3136, offset: 114048)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 3136, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 196)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_data", scope: !715, file: !714, line: 53, baseType: !746, size: 408, offset: 117184)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 408, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 51)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_data", scope: !715, file: !714, line: 54, baseType: !750, size: 224, offset: 117592)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 224, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: 28)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_data", scope: !715, file: !714, line: 55, baseType: !754, size: 13168, offset: 117816)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 13168, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 1646)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_data", scope: !715, file: !714, line: 56, baseType: !758, size: 226824, offset: 130984)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 226824, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 28353)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_data", scope: !715, file: !714, line: 58, baseType: !762, size: 14432, offset: 357808)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 14432, elements: !763)
!763 = !{!764}
!764 = !DISubrange(count: 1804)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "codeset_8_bit", scope: !715, file: !714, line: 62, baseType: !766, size: 15824, offset: 372240)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 15824, elements: !780)
!767 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "__codeset_8_bit_t", file: !769, line: 21, baseType: !770)
!769 = !DIFile(filename: "./extra/locale/c8tables.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 16, size: 688, elements: !771)
!771 = !{!772, !774, !775, !776}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !770, file: !769, line: 17, baseType: !773, size: 128)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 128, elements: !503)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !770, file: !769, line: 18, baseType: !773, size: 128, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !770, file: !769, line: 19, baseType: !773, size: 128, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !770, file: !769, line: 20, baseType: !777, size: 304, offset: 384)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 304, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 38)
!780 = !{!781}
!781 = !DISubrange(count: 23)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_rows", scope: !715, file: !714, line: 65, baseType: !783, size: 160, offset: 388064)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 160, elements: !81)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_offsets", scope: !715, file: !714, line: 65, baseType: !785, size: 160, offset: 388224)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 160, elements: !350)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_idx", scope: !715, file: !714, line: 65, baseType: !787, size: 320, offset: 388384)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 320, elements: !81)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_rows", scope: !715, file: !714, line: 66, baseType: !789, size: 360, offset: 388704)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 360, elements: !790)
!790 = !{!791}
!791 = !DISubrange(count: 45)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_offsets", scope: !715, file: !714, line: 66, baseType: !793, size: 48, offset: 389072)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 48, elements: !177)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_idx", scope: !715, file: !714, line: 66, baseType: !795, size: 240, offset: 389120)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 240, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 15)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_rows", scope: !715, file: !714, line: 67, baseType: !799, size: 31152, offset: 389360)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 31152, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 3894)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_offsets", scope: !715, file: !714, line: 67, baseType: !803, size: 352, offset: 420512)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 352, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 22)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_idx", scope: !715, file: !714, line: 67, baseType: !807, size: 6512, offset: 420864)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 6512, elements: !808)
!808 = !{!809}
!809 = !DISubrange(count: 407)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_rows", scope: !715, file: !714, line: 68, baseType: !811, size: 66000, offset: 427376)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 66000, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 8250)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_offsets", scope: !715, file: !714, line: 68, baseType: !815, size: 800, offset: 493376)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 800, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 50)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_idx", scope: !715, file: !714, line: 68, baseType: !819, size: 54864, offset: 494176)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 54864, elements: !820)
!820 = !{!821}
!821 = !DISubrange(count: 3429)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_rows", scope: !715, file: !714, line: 70, baseType: !823, size: 2976, offset: 549040)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 2976, elements: !824)
!824 = !{!825}
!825 = !DISubrange(count: 372)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_offsets", scope: !715, file: !714, line: 70, baseType: !827, size: 64, offset: 552016)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 64, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 4)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_idx", scope: !715, file: !714, line: 70, baseType: !831, size: 3200, offset: 552080)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 3200, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 200)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "collate_data", scope: !715, file: !714, line: 72, baseType: !835, size: 1458256, offset: 555280)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 1458256, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 91141)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_item_offsets_LEN", scope: !715, file: !714, line: 74, baseType: !345, size: 48, offset: 2013536)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_tbl_offsets", scope: !715, file: !714, line: 75, baseType: !840, size: 1536, offset: 2013632)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1536, elements: !841)
!841 = !{!842}
!842 = !DISubrange(count: 24)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "locales", scope: !715, file: !714, line: 80, baseType: !844, size: 22608, offset: 2015168)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 22608, elements: !845)
!845 = !{!846}
!846 = !DISubrange(count: 2826)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "locale_names5", scope: !715, file: !714, line: 81, baseType: !848, size: 6680, offset: 2037776)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 6680, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 835)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "locale_at_modifiers", scope: !715, file: !714, line: 82, baseType: !852, size: 144, offset: 2044456)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 144, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 18)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lc_names", scope: !715, file: !714, line: 85, baseType: !856, size: 552, offset: 2044600)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 552, elements: !857)
!857 = !{!858}
!858 = !DISubrange(count: 69)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "codeset_list", scope: !715, file: !714, line: 87, baseType: !860, size: 2040, offset: 2045152)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 2040, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 255)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "__C_ctype_b_data", scope: !866, file: !871, line: 471, type: !872, isLocal: false, isDefinition: true)
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !868, splitDebugInlining: false, nameTableKind: None)
!867 = !DIFile(filename: "libc/misc/ctype/__C_ctype_b.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!868 = !{!864, !869}
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(name: "__C_ctype_b", scope: !866, file: !871, line: 862, type: !316, isLocal: false, isDefinition: true)
!871 = !DIFile(filename: "libc/misc/ctype/ctype.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 6144, elements: !331)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "__C_ctype_tolower_data", scope: !875, file: !871, line: 878, type: !880, isLocal: false, isDefinition: true)
!875 = distinct !DICompileUnit(language: DW_LANG_C99, file: !876, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !877, splitDebugInlining: false, nameTableKind: None)
!876 = !DIFile(filename: "libc/misc/ctype/__C_ctype_tolower.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!877 = !{!873, !878}
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "__C_ctype_tolower", scope: !875, file: !871, line: 981, type: !323, isLocal: false, isDefinition: true)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 6144, elements: !331)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(name: "__C_ctype_toupper_data", scope: !883, file: !871, line: 1000, type: !880, isLocal: false, isDefinition: true)
!883 = distinct !DICompileUnit(language: DW_LANG_C99, file: !884, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !885, splitDebugInlining: false, nameTableKind: None)
!884 = !DIFile(filename: "libc/misc/ctype/__C_ctype_toupper.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!885 = !{!881, !886}
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(name: "__C_ctype_toupper", scope: !883, file: !871, line: 1103, type: !323, isLocal: false, isDefinition: true)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "errno", scope: !890, file: !891, line: 7, type: !45, isLocal: false, isDefinition: true)
!890 = distinct !DICompileUnit(language: DW_LANG_C99, file: !891, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !892, splitDebugInlining: false, nameTableKind: None)
!891 = !DIFile(filename: "libc/misc/internals/errno.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!892 = !{!888, !893}
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(name: "h_errno", scope: !890, file: !891, line: 8, type: !45, isLocal: false, isDefinition: true)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "static_fd", scope: !897, file: !898, line: 39, type: !45, isLocal: true, isDefinition: true)
!897 = distinct !DICompileUnit(language: DW_LANG_C99, file: !898, producer: "Ubuntu clang version 11.1.0-++20211011094159+1fdec59bffc1-1~exp1~20211011214614.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !899, globals: !935, splitDebugInlining: false, nameTableKind: None)
!898 = !DIFile(filename: "libc/misc/utmp/utent.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!899 = !{!6, !900, !903, !7}
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !901, line: 88, baseType: !902)
!901 = !DIFile(filename: "./include/sys/types.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !321, line: 145, baseType: !121)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmp", file: !905, line: 60, size: 3200, elements: !906)
!905 = !DIFile(filename: "./include/bits/utmp.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!906 = !{!907, !908, !911, !913, !915, !916, !917, !922, !923, !931, !934}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !904, file: !905, line: 62, baseType: !327, size: 16)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !904, file: !905, line: 63, baseType: !909, size: 32, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !901, line: 100, baseType: !910)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !321, line: 147, baseType: !45)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !904, file: !905, line: 64, baseType: !912, size: 256, offset: 64)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 256, elements: !700)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !904, file: !905, line: 65, baseType: !914, size: 32, offset: 320)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !828)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !904, file: !905, line: 66, baseType: !912, size: 256, offset: 352)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !904, file: !905, line: 67, baseType: !138, size: 2048, offset: 608)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !904, file: !905, line: 68, baseType: !918, size: 32, offset: 2656)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exit_status", file: !905, line: 52, size: 32, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !918, file: !905, line: 54, baseType: !327, size: 16)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !918, file: !905, line: 55, baseType: !327, size: 16, offset: 16)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !904, file: !905, line: 81, baseType: !121, size: 64, offset: 2688)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !904, file: !905, line: 82, baseType: !924, size: 128, offset: 2752)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !925, line: 73, size: 128, elements: !926)
!925 = !DIFile(filename: "./include/bits/time.h", directory: "/home/framos/Tools/Klee/klee-uclibc")
!926 = !{!927, !929}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !924, file: !925, line: 75, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !321, line: 153, baseType: !121)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !924, file: !925, line: 76, baseType: !930, size: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !321, line: 155, baseType: !121)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !904, file: !905, line: 85, baseType: !932, size: 128, offset: 2880)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 128, elements: !828)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !18, line: 41, baseType: !45)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !904, file: !905, line: 86, baseType: !80, size: 160, offset: 3008)
!935 = !{!895, !936, !938, !940}
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(name: "static_utmp", scope: !897, file: !898, line: 40, type: !904, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "static_ut_name", scope: !897, file: !898, line: 42, type: !29, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "default_file_name", scope: !897, file: !898, line: 41, type: !942, isLocal: true, isDefinition: true)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 112, elements: !338)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(name: "spec_base", scope: !945, file: !946, line: 1441, type: !1083, isLocal: true, isDefinition: true)
!945 = distinct !DISubprogram(name: "_do_one_spec", scope: !946, file: !946, line: 1438, type: !947, scopeLine: 1440, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1024, retainedNodes: !4)
!946 = !DIFile(filename: "libc/stdio/_vfprintf.c", directory: "/home/framos/Tools/Klee/klee-uclibc")
!947 = !DISubroutineType(types: !948)
!948 = !{!45, !949, !973, !681}
!949 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !950)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !515, line: 46, baseType: !952)
